{
    "main_fs_start_optimization": "Starts the optimization after you set all settings in the GUI.",
    "main_fu_model_definition": "Insert your model definition which you want to run. Make sure to upload the file again after you made changes in the .xlsx sheet.",
    "main_sl_number_threats": "Number of threads to use for the model run on your machine. You should make sure that the chosen solver supports enough threats (cbc: max. 1 (if no parallelized version), gurobi: max. 8).",
    "main_sb_solver": "Choose a of the supported solver. Make sure that the solver is installed and configurated on your machine. We recommend using the gurobi solver if you can use an academic licence.",
    "main_dd_timeser_algorithm": "Indication of the simplification algorithm to be applied. Detailed information is given in the documentation.",
    "main_dd_timeser_cluster_index": "Algorithm specific configuration. Detailed information is given in the documentation.",
    "main_dd_timeser_cluster_criterion": "Criterion according to which cluster algorithms are applied. Detailed information is given in the documentation.",
    "main_dd_timeser_period": "Time periods which are clustered together (weeks, days, hours). Detailed information is given in the documentation",
    "main_dd_timeser_season": "Time periods within which clustering takes place (year, seasons, months). Detailed information is given in the documentation.",
    "main_cb_prem_active": "Activates pre-modeling for your model run.",
    "main_cb_thightening_active": "Must be checked if “tightening of technical boundaries” should be carried out.",
    "main_sl_tightening_factor": "Define the factor applied for tightening investment decisions.",
    "main_dd_prem_timeser_algorithm": "Indication of the simplification algorithm to be applied. Detailed information is given in the documentation.",
    "main_dd_prem_timeser_cluster_index": "Algorithm specific configuration. Detailed information is given in the documentation.",
    "main_dd_prem_timeser_cluster_criterion": "Criterion according to which cluster algorithms are applied. Detailed information is given in the documentation.",
    "main_dd_prem_timeser_period": "Time periods which are clustered together (weeks, days, hours). Detailed information is given in the documentation.",
    "main_dd_prem_timeser_season": "Time periods within which clustering takes place (year, seasons, months). Detailed information is given in the documentation.",
    "main_cb_xlsx_results": "Choose to save detailed model results for every bus.",
    "main_cb_console_results": "Choose to enable detailed model information as terminal output.",
    "main_cb_criterion_switch": "Choose to switch primary and secondary criterion.",
    "main_ms_pareto_points": "Choose pareto point(s) if you want to start a pareto optimization run. The chosen value defines the constraint reduction in percent refering to the cost minimal pareto point.",
    "main_cb_activate_dh_precalc": "Choose if you want to use a district heating precalculation. If so choose the result folder in which the results were safed in the selectbox below.",
    "main_dd_result_folder": "Choose the an existing results folder in which the precalculation was done. The folder must be placed in the .../results/ directory of the SESMG application.",
    "main_cb_cluster_dh": "Choose if you want to activate the district heating clustering. It will cluster the street part (label) as defined in the district heating sheet.",
    "main_fs_clear_cache": "The latest GUI settings are saved on default. Press to reset all GUI settings.",
    "main_info_spinner": "After the optimization process has been running, you will be automatically directed to the results processing page.",
    "main_error_defintion": "Model definition is missing! Plase make sure to upload a model definition file.",
    "udu_fs_start_US_tool": "Starts the generation of an upscaling model definition if you uploaded the files requested and chose a model definition name.",
    "udu_fu_us_sheet": "Upload the urban upscaling sheet. You can find the a blank one at .../program_files/urban_district_upscaling/.",
    "udu_fu_sp_sheet": "Upload the standard parameter sheet. You can find the given one at .../program_files/urban_district_upscaling/.",
    "udu_ti_model_def_name": "Choose the name of the model definition to be generated.",
    "udu_b_download_model_def": "Download the recently generated model definition.",
    "res_dd_result_folder": "Choose the an existing results folder which you want to open. The folder must be placed in the .../results/ directory of the SESMG application.",
    "res_b_load_results": "Loads existings results on click.",
    "res_dd_pareto_point": "Choose the pareto point which you want to see in the short result overview."
}



